//---------------------------------------------------------------------------------------
//! @file   Config.h
//! @brief  Заголовочный файл с #include, #define, enum и struct
//! @author Станислав Литвин
//! @date   26.08.2026
//---------------------------------------------------------------------------------------

#include <TXLib.h>
#include <stdio.h>
#include <math.h>
#include <assert.h>
#include <windows.h>
#include <string.h>
#include <stdlib.h>

//---------------------------------------------------------------------------------------
//! @brief Цена за одну попытку решения уравнения
//---------------------------------------------------------------------------------------
#define  COST_SERVICE 100

//---------------------------------------------------------------------------------------
//! @brief Цвета для красивого вывода
//---------------------------------------------------------------------------------------
#define  RESET        "\033[0m"
#define  GREEN        "\033[32m"
#define  YELLOW       "\033[33m"
#define  BLUE         "\033[36m"
#define  RED          "\033[31m"

//---------------------------------------------------------------------------------------
//! @brief Возможные количества корней уравнения
//---------------------------------------------------------------------------------------
enum Roots_Number { Roots_0         =  0,
                    Roots_1         =  1,
                    Roots_2         =  2,
                    Roots_Inf       = -1,
                    Roots_Incorrect = 10 };

//---------------------------------------------------------------------------------------
//! @brief Режим работы программы (консоль/файл)
//---------------------------------------------------------------------------------------
enum Mode_Condition { Mode_Console   =  1,
                      Mode_File      =  2,
                      Mode_Incorrect = -1 };

//---------------------------------------------------------------------------------------
//! @brief Код ошибки программы
//---------------------------------------------------------------------------------------
enum Errors { Not_Error            = 0,
              Error_File_Open      = 1,
              Error_File_Close     = 2,
              Error_Incorrect_Mode = 3 };

//---------------------------------------------------------------------------------------
//! @brief Структура для хранения коэффициентов уравнения (a, b, c)
//---------------------------------------------------------------------------------------
struct Coeffs {
    double Coeff_a;
    double Coeff_b;
    double Coeff_c;
};

//---------------------------------------------------------------------------------------
//! @brief Структура для хранения корней уравнения и их количества (x1, x2, Number of roots)
//---------------------------------------------------------------------------------------
struct Roots {
    double Root1;
    double Root2;
    int    Number_Of_Roots;
};
